group_project_2_duckoverflow_improved/app/controllers/comments_controller.rb

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    if params[:question_id]
      @question = Question.find(params[:question_id])

INSERT INTO "comments" ("commentable_id", "commentable_type", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    # Hm, take a look at the if/else and then the if/else embedded in the
    # @comment.save action.  You're basically if/elsing on the same conditions.
    # Maybe you could combine those if/elses, maybe extract to a method, and
    # then put that method in ApplicationController?

    commentable_id = params[:question_id] ||= params[:answer_id]
    if params[:answer_id]
      commentable_type = "Answer"
    else
      commentable_type = "Question"
    end
    @comment = Comment.new(content: params[:comment][:content],
                           user_id: session[:user_id],
                           commentable_id: commentable_id,
                           commentable_type: commentable_type)
    if @comment.save
      user = User.find(session[:user_id])
      user.comments << @comment
      if @comment.commentable_type == "Question"
        question = Question.find(params[:question_id])