group_project_2_duckoverflow_improved/app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT "questions".* FROM "questions"

  def show
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @question = Question.new(question_params)
    user = User.find(session[:user_id])
    @question.user = user
    if @question.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "questions" ("content", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"