group_project_2_duckoverflow_improved/app/controllers/votes_controller.rb

INSERT INTO "votes" ("created_at", "updated_at", "upvote", "user_id", "voteable_id", "voteable_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-10-14 20:48:51.611536"], ["updated_at", "2014-10-14 20:48:51.611536"], ["upvote", "t"], ["user_id", 1], ["voteable_id", 1], ["voteable_type", "Question"]]
SELECT  "votes".* FROM "votes"  WHERE "votes"."id" = $1 LIMIT 1  [["id", 1]]
---
  def up_question_vote
    previous_vote = current_user_vote("Question", session[:question_id])
    if previous_vote == nil
      # How about a Vote.create_upvote method?  You could pass the session and
      # votable id and votable type into it?  Perhaps the calculation of
      # votable id and votable type could be handled in a private method inside
      # this controller?
      @vote = Vote.create(upvote: true, user_id: session[:user_id], voteable_id: session[:question_id], voteable_type: "Question")
      redirect_to "/questions/#{session[:question_id]}" # use named routes
    else
      new_vote = Vote.find(previous_vote.id)